c3845-inet-1#sh run | s ^router ospf
router ospf 2
 router-id 172.25.6.102
 log-adjacency-changes
 passive-interface default
 no passive-interface FastEthernet0/0
 no passive-interface FastEthernet1/0
 network 172.25.6.102 0.0.0.0 area 0
 network 178.74.181.80 0.0.0.15 area 0
 default-information originate

c3845-inet-1#sh inventory
NAME: "3725 chassis", DESCR: "3725 chassis"
PID:                   , VID: 0.1, SN: FTX0945W0MY

NAME: "One port Fastethernet TX on Slot 1", DESCR: "One port Fastethernet TX"
PID: NM-1FE-TX=        , VID: 1.0, SN: 7720321    

NAME: "One port Fastethernet TX on Slot 2", DESCR: "One port Fastethernet TX"
PID: NM-1FE-TX=        , VID: 1.0, SN: 7720321    



c3845-inet-1#sh clock
*20:37:55.148 UTC Sat Mar 2 2002

c3845-inet-2#sh ip int br
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            178.74.181.93   YES NVRAM  up                    up      
FastEthernet0/1            188.254.42.126  YES NVRAM  up                    up      
FastEthernet1/0            172.16.0.2      YES NVRAM  up                    up      
FastEthernet2/0            10.10.10.1      YES NVRAM  up                    up      
Loopback0                  172.25.6.103    YES NVRAM  up                    up      
Loopback11                 5.5.5.5         YES NVRAM  up                    up      
Loopback12                 5.5.5.6         YES NVRAM  up                    up      
Loopback100                100.100.100.100 YES NVRAM  administratively down down    
Loopback1000               1.1.1.1         YES NVRAM  administratively down down    
Loopback1001               1.1.1.2         YES NVRAM  administratively down down    

c3845-inet-2#sh run | i hostname
hostname c3845-inet-2

